---
kind: method
id: M:Autodesk.Revit.DB.Architecture.ContinuousRail.GetStartExtensionPath
source: html/dd727047-b0b9-310d-6749-016489eb5310.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail.GetStartExtensionPath Method

Retrieves the start extension path.

## Syntax (C#)
```csharp
public IList<Curve> GetStartExtensionPath()
```

## Returns
The start extension path of the rail.